package Chepter3;

public class Object {
    // 객체 - 대상이되는 모든 사물
    // 객체 모델링 - 객체의 특성을 표현할 수있는 '속성'과 움직임을 표현하는 '동작'
    // 객체 추상화 - 반드시 꼭 필요한 객체들만 추출하는 것
    // OOP - 객체지향 프로그래밍

    // 객체지향 개발 3단계
    // 분석단계 객체 모델링 -> 설계단계 클래스 정의 -> 구현단계의 객체생성과 사용

    /*
    *   1. 객체 모델링
    *   -> 프로그램을 개발할 때 필요한 객체의 속성과 동작을 추출한다.
    *       1. 일반화 방법 - 객체에서 일반적인 요소 추출
    *       ex) 고등학생 에서 학생 '학생'-> 일반방법
    *
    *       2. 구체화 방법 - 세분화
    *       ex) 대학생, 고등학생, 중학생 <- 세분화
    *
    *   2. 클래스 정의
    *   -> 객체를 자바 프로그램으로 개발하기 위해 클래스 형태로 표현
    *   객체 속성 - 인스턴스
    *   객체 동작 - 클래스의 메서드
    *
    *   3. 객체 생성과 사용
    *   -> 정의된 클래스를 사용하기 위해서 메모리에 올리는 작업 필요 = '객체 생성' or '객체의 인스턴스화'
    *   -> 모든 클래스는 반드시 인스턴스화 작업을 통해 사용가능
    *
    *   -> 객체가 생성 되면 클래스의 구성요소들인 '인스턴스 변수'와  '메서드'가 메모리에 위치
    *      메모리에 올라간 객체를 '인스턴스(instance)'라고 한다. = 이러한 이유로 메모리에 올라간 변수를 인스턴스 변수라고 함
    *
    *   하나의 클래스로 여러 인스턴스를 생성할 수있다 = 클래스는 인스턴스를 생성하기 위한 틀 역활이다.
    *
    *
    * */
}
